01 WS-COPY.
 05 WS-COPY-1 PIC 9(2) VALUE 24.
 05 WS-COPY-2 PIC X(2) VALUE 'AB'.
01 WS-NAMES.
 05 WS-FIRSTNAME PIC X(20) VALUE 'FIRST'.
 05 WS-LASTNAME PIC X(20) VALUE 'LAST'.
