//STEP010  EXEC PGM=IDCAMS,COND=(0,NE)            
//SYSPRINT DD    SYSOUT=*                         
//SYSIN    DD  *                                  
 ALTER <old file name>           -  
  NEWNAME(<new file name>)             
/*                                                