//* TO GET THE REPORT OF FILE BASED ON 
//* SPECIFIC COLUMN
//STEP010 EXEC PGM=ICETOOL
//INDD DD DSN=<INPUT FILE>,DISP=SHR
//RPT  DD DSN=* /* OR CHANGE TO ANY FILE
//TOOLIN DD *
  OCCURS FROM(INDD) ON(1,10,CH) -
                    ON(20,3,CH) -
                    ON(VALCNT) BLANK-
                    HEADER('FCOL') HEADER('SCOL') HEADER('TCOL')
/*
