//* JCL TO COUNT THE RECORDS IN INPUT FILE(BASED ON COND)
//STEP010 EXEC PGM=SORT
//SORTIN DD DSN=<INPUT FILE>
//SORTOUT DD SYSOUT=*   /* DISPLAY IN SPOOL
//SYSIN DD *
 OPTION COPY
 OUTFIL REMOVECC,NODETAIL
 SECTIONS=(1,2,
     TRAILER3=(1,2,X,COUNT=(M11,LENGTH=9)))
/*
//* Group from input the counts of Unique Values in Position 1,2 
