//* ICETOOL to remove Header and Trailer from i/p file
//STEP001 EXEC PGM=ICETOOL
//TOOLMSG DD SYSOUT=*
//DFSMSG DD SYSOUT=*
//INDD DD DSN=<INPUT FILE>,DISP=SHR
//OUTDD DD DSN=<OUT PUT FILE>,DISP=MOD
//TOOLIN DD *
 SUBSET FROM(INDD) TO(OUTDD) INPUT REMOVE HEADER TRAILER
/*
//CTL1CNT DD *
 SORT FIELDS=COPY
/*
//* TO REMOVE LAST RECORD WE CAN USE
//* REMOVE INPUT LAST 
