//* JCL TO SORT AND SPLIT THE FILE INTO MULTIPLE FILES
//* BASED ON GIVEN CONDITION
//STEP010 EXEC PGM=SORT
//SORTIN DD DSN=<INPUT FILE>,DISP=SHR
//SORTOF1 DD DSN=<OUTFILE 1>,DISP=OLD     /* CHANGE TO NEW FOR NEW
//SORTOF2 DD DSN=<OUTFILE 2>,DISP=OLD     /* CHANGE TO NEW FOR NEW
//SYSIN DD *
 SORT FIELDS=COPY
 OUTFIL FILE=01,
 INCLUDE=(1,2,CH,EQ,'AB',AND,5,2,CH,EQ,'12')
 OUTFILE FILE=02,
 INCLIDE=(1,2,CH,NE,'AB',AND',5,2,CH,NE,'12')
 /*
