//IBMLIB   JCLLIB  ORDER='SYS1.ADMIN.PROCLIB'
//JS0010 EXEC  DSNH7COB,MEMBER=DB2CURS,      
//             SRCELIB=TRNG497.COBOL.SRC,    
//             DBRMLIB=TRNG497.COBOL.DBRM,   
//*            INCLLIB=TRNG01.DCLGEN(M1),    
//             LOADLIB=TRNG497.COBOL.LOAD    
//*SYSOUT   DD SYSOUT=*                      
//*SYSPRINT DD SYSOUT=*                      
/*                                           
