//STEP010 EXEC PGM=IDCAMS                     
//SYSPRINT DD SYSOUT=*                        
//SYSIN    DD *                               
 LISTCAT ENTRIES('filename') VOLUME/ALL/ALLOCATION
/*                                            
